Repository: EricHier/automaton
Catalog: localization/*.xlf
Languages: de, id, lv

# sae4f7c13b7ec18ff
source: Stack
de: Stapel
id: Tumpukan
lv: Steks

# s904fefb3d01cb2ae
source: empty
de: leer
id: kosong
lv: tukšs

# s42b6431842b835b3
source: Language:
de: Sprache:
id: Bahasa:
lv: Valoda:

# sa4088b649da557a5
source: Check Automaton
de: Automaten prüfen
id: Periksa Automaton
lv: Pārbaudes automāts

# s337a1e9022a8d19f
source: Table
de: Tabelle
id: Tabel
lv: Tabula

# se6a414abec96883f
source: States:
de: Zustände:
id: Negara:
lv: Valstis:

# s033b7cf13e11023b
source: Transitions:
de: Übergänge:
id: Transisi:
lv: Pārejas:

# sa3c972a6b05ed840
source: Initial State:
de: Startzustand:
id: Status Awal:
lv: Sākotnējais stāvoklis:

# saa415adf36e8d84f
source: Final States:
de: Endzustände:
id: Keadaan Akhir:
lv: Galīgās valstis:

# s09318db807188948
source: Add Sinkstate
de: Senke hinzufügen
id: Tambahkan Sinkstate
lv: Pievienot Sinkstate

# s78bc8524e7c2d052
source: Sink
de: Senke
id: Wastafel
lv: Izlietne

# sb80ac0a010cbc647
source: Automaton Type
de: Automatentyp
id: Jenis Otomat
lv: Automāta tips

# se033711991bc46ea
source: DFA
de: DEA

# s36dfd719c2d7c63c
source: NFA
de: NEA

# s8d5ca919f3cad950
source: PDA
de: KA

# s4f6476c3d1856c19
source: No further moves possible. Try a different path.
de: Keine weiteren Schritte möglich. Versuchen Sie einen anderen Pfad.
id: Tidak ada gerakan lebih lanjut yang mungkin dilakukan. Coba jalur yang berbeda.
lv: Turpmākie soļi nav iespējami. Izmēģiniet citu ceļu.

# sed72ab193dd16a0a
source: Simulation paused.
de: Die Simulation wurde pausiert.
id: Simulasi dijeda.
lv: Simulācija apstājās.

# saad05eab0e59411c
source: Input Word e.g. aaabbb, step;step;stop
de: Eingabewort, z. B. aaabbb, Schritt;Schritt;Stopp
id: Kata Masukan, misalnya aaabbb, langkah; langkah; berhenti
lv: Ievads Vārds, piemēram, aaabbb, solis;solis;apstāties

# s956c5a9fb7ee0b23
source: Manual
de: Manuell
lv: Rokasgrāmata

# s61f0ff0bab2b8310
source: Animate
de: Animieren
id: Menghidupkan
lv: Animēt

# s36494e700fe1e5c6
source: Step by Step
de: Schritt für Schritt
id: Langkah demi Langkah
lv: Soli pa solim

# s42cbd8dca939a9c7
source: Check
de: Prüfen
id: Periksa
lv: Pārbaudiet

# sc16e00a7a8b2fde2
source: Back
de: Zurück
id: Kembali
lv: Atpakaļ

# s0fbf6dc6a1966408
source: Next
de: Weiter
id: Berikutnya
lv: Nākamais

# s255857544a9d5ec0
source: Reset
de: Zurücksetzen
id: Atur ulang
lv: Atiestatīt

# scd105819b5a10243
source: Play
de: Weiter
id: Bermain
lv: Spēlēt

# sd9ad53251f2330a5
source: Stop
de: Stopp
id: Berhenti.
lv: Pārtraukt

# s9d8b8aa2b404c2c8
source: Settings
de: Einstellungen
id: Pengaturan
lv: Iestatījumi

# s05c44a5db696fcaf
source: Editing
de: Bearbeitung
id: Pengeditan
lv: Rediģēšana

# sf9aee319a006c9b4
source: Add
de: Hinzufügen
id: Menambahkan
lv: Pievienot

# sdc673e73b5c13aea
source: Delete
de: Löschen
id: Menghapus
lv: Dzēst

# s2f64461723d3df5d
source: Change
de: Ändern
id: Perubahan
lv: Mainīt

# s66bd1cc6d2f6b68d
source: Node
de: Zustand
lv: Mezgls

# s6503256c2de2745c
source: Edge
de: Übergang
id: Tepi

# s860b83fc8a41ca5c
source: Automaton Types
de: Automaten-Typen
id: Jenis Otomat
lv: Automātu tipi

# s1c2404542b3e48d9
source: Transformations
de: Transformationen
id: Transformasi
lv: Transformācijas

# s568f5722bc79d077
source: Sinkstate
de: Senke

# s7f59f507e02a2f38
source: View
de: Ansicht
id: Melihat
lv: Skatīt

# sb508f35111b54817
source: Show Help
de: Hilfe anzeigen
id: Tampilkan Bantuan
lv: Rādīt palīdzību

# sf62fea3229bf87c8
source: Show Formal Definition
de: Formale Definition anzeigen
id: Tampilkan Definisi Formal
lv: Rādīt formālo definīciju

# s3050764b15c8baf0
source: Show Transitions Table
de: Übergangstabelle anzeigen
id: Tampilkan Tabel Transisi
lv: Rādīt pāreju tabulu

# se9d940b50ed4b85f
source: PDA Label Style
de: PDA-Beschriftungsstil
id: Gaya Label PDA
lv: PDA etiķetes stils

# s35f1dd3fd023476a
source: Automation
de: Automatisierung
id: Otomatisasi
lv: Automatizācija

# s3e141c08e0ace321
source: Test Language
de: Testsprache
id: Bahasa Tes
lv: Testa valoda

# scbb4cdb4d52edc80
source: Test Words
de: Testwörter
id: Kata-kata Tes
lv: Testa vārdi

# s8e3f9c3e183abbda
source: Predefined Alphabet
de: Vorgegebenes Alphabet
id: Abjad yang Telah Ditentukan Sebelumnya
lv: Iepriekš definēts alfabēts

# s21b06c38fc4164db
source: Advanced
de: Fortgeschritten
id: Lanjutan

# s1b5a859826f8be7d
source: Verbose
de: Ausführliche Ausgaben

# s7df224ba56fb8e1e
source: Mode Switch
de: Modus-Schalter
id: Sakelar Mode
lv: Režīma pārslēgs

# s4b10acae683d2978
source: Fullscreen
de: Vollbildschirm
id: Layar penuh
lv: Pilnekrāna

# sd2223afb7d6b100d
source: Type
de: Typ
id: Jenis
lv: Tips

# s352719d86112de9a
source: Help
de: Hilfe
id: Bantuan
lv: Palīdzība

# sc725a41694d85bb0
source: Test Cases
de: Testfälle
id: Kasus Uji
lv: Testēšanas gadījumi

# sd341bbdc948e6521
source: Add Node by click
de: Zustand durch Anklicken hinzufügen
id: Tambahkan Node dengan klik
lv: Pievienojiet mezglu ar klikšķi

# s9f4a96e81b296478
source: Add Transition by drag and drop
de: Übergänge durch Ziehen und Ablegen hinzufügen
id: Tambahkan Transisi dengan seret dan lepas
lv: Pārejas pievienošana, velkot un nometot

# s7b72a2e6d7ff3291
source: Move the elements by drag and drop
de: Verschieben der Elemente durch Ziehen und Ablegen
id: Memindahkan elemen dengan seret dan lepas
lv: Pārvietot elementus, velkot un nometot

# s09c6c5bc21d0e1f0
source: To edit a node right click the node
de: Um einen Zustand zu bearbeiten, klicken Sie mit der rechten Maustaste auf den Zustand
id: Untuk mengedit sebuah node, klik kanan node tersebut
lv: Lai rediģētu mezglu, noklikšķiniet uz tā ar peles labo pogu

# s6a7a6503441d48ee
source: To edit a transition right click the transition
de: Um einen Übergang zu bearbeiten, klicken Sie mit der rechten Maustaste auf den Übergang
id: Untuk mengedit transisi, klik kanan transisi tersebut
lv: Lai rediģētu pāreju, noklikšķiniet uz pārejas ar peles labo pogu

# s71813a5a8d63ac81
source: Input word
de: Eingabewort
id: Kata masukan
lv: Ievadvārds

# sa82cf626cfa888ac
source: Simulation Controls
de: Simulationssteuerung
id: Kontrol Simulasi
lv: Simulācijas vadības ierīces

# s64ef2a6c2dd1d3d1
source: Edit
de: Bearbeiten
id: Sunting
lv: Rediģēt

# scfcffcf35292bc6f
source: Simulate
de: Simulieren
id: Mensimulasikan
lv: Simulēt

# s5590dbf7e425789d
source: Label
de: Beschriftung
lv: Etiķete

# sfb68cae41d749423
source: Initial
de: Startzustand
id: Awal
lv: Sākotnējais

# s8f1034e1a9d93097
source: Final
de: Endzustand
id: Akhir
lv: Galīgais

# s09243007b5b91006
source: If
de: Wenn
id: Jika
lv: Ja

# s3de7bee91528e5cc
source: Stack Actions
de: Stapel-Aktionen
id: Tindakan Tumpukan
lv: Kaudzes darbības

# s66da3efd9a45b25a
source: Empty Check
de: Prüfe Leerheit
id: Cek Kosong
lv: Tukša pārbaude

# sd60a7dde73859828
source: Keep
de: Beibehalten
id: Simpan
lv: Saglabājiet

# sba6693303903d6b8
source: Add symbol
de: Symbol hinzufügen
id: Tambahkan simbol
lv: Pievienot simbolu

# sa0a141a796a5b36a
source: Bend
de: Biegung
id: Membungkuk

# h6c2fe3d409d7ba36
source: No valid path found. The automaton <sl-badge variant="danger">rejects </sl-badge> the word <b>${this._automaton.simulator.word}</b>.
de: Kein gültiger Pfad gefunden. Der Automat <sl-badge variant="danger">lehnt </sl-badge> das Wort <b>${this._automaton.simulator.word}</b> ab.
id: Tidak ditemukan jalur yang valid. Otomat <sl-badge variant="danger">menolak </sl-badge> kata <b>${this._automaton.simulator.word}</b>.

# h2e7f32ac617924d0
source: Missing transition for <b>${this.letter}</b>
de: Fehlender Übergang für <b>${this.letter}</b>
id: Transisi yang hilang untuk <b>${this.letter}</b>

# h5130af20b6d54f05
source: Multiple transitions for <b>${this.letter}</b>
de: Mehrere Übergänge für <b>${this.letter}</b>
id: Beberapa transisi untuk <b>${this.letter}</b>

# s2ea31ea953b32ee5
source: Transition with empty symbol
de: Übergang mit leerem Symbol
id: Transisi dengan simbol kosong
lv: Pāreja ar tukšu simbolu

# s5787e20cab57b383
source: Unknown error
de: Unbekannter Fehler
id: Kesalahan yang tidak diketahui
lv: Nezināma kļūda

# h56d667fd1fb9d47d
source: Please fix the following <sl-badge variant="danger">errors </sl-badge> to run the simulation:
de: Bitte beheben Sie die folgenden <sl-badge variant="danger">Fehler, </sl-badge> um die Simulation durchzuführen:
id: Harap perbaiki yang berikut ini <sl-badge variant="danger">kesalahan </sl-badge> untuk menjalankan simulasi:

# h25e62c96f8182fcc
source: <span>The automaton <sl-badge variant="success">accepts </sl-badge> the word <b>${this._automaton.simulator.word || "ε"}</b>. </span>
de: <span>Der Automat <sl-badge variant="success">akzeptiert </sl-badge> das Wort <b>${this._automaton.simulator.word}</b>. </span>
id: <span>Otomat <sl-badge variant="success">menerima </sl-badge> kata <b>${this._automaton.simulator.word}</b>. </span>

# h28031e78bb7297a9
source: <span>The automaton <sl-badge variant="danger">rejects </sl-badge> the word <b>${this._automaton.simulator.word || "ε"}</b>. </span>
de: <span>Der Automat <sl-badge variant="danger">lehnt </sl-badge> das Wort <b>${this._automaton.simulator.word}</b> ab. </span>
id: <span>Robot <sl-badge variant="danger">menolak </sl-badge> kata <b>${this._automaton.simulator.word}</b>. </span>

# s1b00cf75d5f4f616
source: Choose a move:
de: Wählen Sie einen Zug:
id: Pilihlah sebuah langkah:
lv: Izvēlieties kustību:

# s3c0d17bad169557b
source: none
de: nichts
id: tidak ada
lv: nav

# s261af1b4598fef3f
source: Allowed modes
de: Erlaubte Modi
id: Mode yang diizinkan
lv: Atļautie režīmi

# s11b075d3731a5194
source: Add node (Ctrl+Q)
de: Zustand hinzufügen (Strg+Q)
id: Menambahkan simpul (Ctrl+Q)
lv: Pievienot mezglu (Ctrl+Q)

# s6ea31a50ccf59dcf
source: Add edge (Ctrl+E)
de: Übergang hinzufügen (Strg+E)
id: Menambahkan tepi (Ctrl+E)
lv: Pievienot malu (Ctrl+E)

# s9274cd474969c49c
source: Switch mode (Ctrl+M)
de: Modus wechseln (Strg+M)
id: Beralih mode (Ctrl+M)
lv: Režīma pārslēgšana (Ctrl+M)

# s6c80030e2762459d
source: push
id: mendorong

# sea4f20ea1ece70a0
source: Definition
id: Definisi
lv: Definīcija

# sfc3c36b69e4ef120
source: Alphabet:
id: Alfabet:
lv: Alfabēts:

# s061cc20e3432dead
source: Pause
id: Jeda
lv: Pauze

# sd083d3aa96af5af1
source: Symbol
id: Simbol
lv: Simbols

# s970d041a28d1067d
source: Push
id: Dorong

# sc1611c0558728a2a
source: Position
id: Posisi
lv: Pozīcija

# h2e7f32ac617924d0
source: Missing transition for <b>${this.letter}</b>
lv: Trūkstošā pāreja <b>${this.letter}</b>

# h5130af20b6d54f05
source: Multiple transitions for <b>${this.letter}</b>
lv: Vairākas pārejas <b>${this.letter}</b>

# h56d667fd1fb9d47d
source: Please fix the following <sl-badge variant="danger">errors</sl-badge> to run the simulation:
lv: Lūdzu, salabojiet šādu <sl-badge variant="danger">kļūdas </sl-badge> lai palaistu simulāciju:

# h6c2fe3d409d7ba36
source: No valid path found. The automaton <sl-badge variant="danger">rejects</sl-badge> the word <b>${this._automaton.simulator.word}</b>.
lv: Nav atrasts derīgs ceļš. Automāts <sl-badge variant="danger">noraida </sl-badge> vārdu <b>${this._automaton.simulator.word}</b>.

# h25e62c96f8182fcc
source: <span>The automaton <sl-badge variant="success">accepts</sl-badge> the word <b>${this._automaton.simulator.word || "ε"}</b>.</span>
lv: <span>Automāts <sl-badge variant="success">pieņem </sl-badge> vārdu <b>${this._automaton.simulator.word}</b>. </span>

# h28031e78bb7297a9
source: <span>The automaton <sl-badge variant="danger">rejects</sl-badge> the word <b>${this._automaton.simulator.word || "ε"}</b>.</span>
lv: <span>Automāts <sl-badge variant="danger">noraida </sl-badge> vārdu <b>${this._automaton.simulator.word}</b>. </span>

# s335050fdf97d8f6e
source: No initial state defined
lv: Sākotnējais stāvoklis nav definēts

# s74a96f52fd23c3e8
source: Multiple initial states defined
lv: Definēti vairāki sākotnējie stāvokļi
